#+HUGO_SECTION: posts
#+HUGO_BASE_DIR: ../
#+TITLE: My EMMS and elfeed setup
#+DATE: 2021-09-03
#+HUGO_DRAFT: true
#+HUGO_TAGS: emacs
#+HUGO_TAGS: emms
#+HUGO_TAGS: elfeed

* MPD
So, we have to start somewhere.

[[https://www.musicpd.org/][MPD]] is a server for playing music, although it is usually hosted on the local machine, i.e. the one on which you intend to listen to music. There is [[https://www.musicpd.org/clients/][bunch of clients]] available (take a look at [[https://github.com/ncmpcpp/ncmpcpp][ncmpcpp]] is you like terminal-based apps), but here our point of interest is its integration with EMMS.

MPD configuration is a pretty easy process. First, install mpd and [[https://www.musicpd.org/clients/mpc/][mpc]] (a minimal MPD CLI client) from your distribution's package repository. After doing that, you'd have to create a config file at the location =~/.config/mpd/mpd.conf=. Mine looks something like this:

#+begin_src conf-space
music_directory     "~/Music"
playlist_directory  "~/.mpd/playlists"
db_file             "~/.mpd/database"
log_file            "~/.mpd/log"
pid_file            "~/.mpd/pid"
state_file          "~/.mpd/state"
sticker_file        "~/.mpd/sticker.sql"

audio_output {
  type    "pulse"
  name    "My Pulse Output"
}
#+end_src

Here =music_directory= is, well, a directory in which MPD will look for music files. Take a look at [[https://linux.die.net/man/5/mpd.conf][man mpd.conf]] and [[https://github.com/MusicPlayerDaemon/MPD/blob/master/doc/mpdconf.example][the default config example]] for more information.

Because MPD is a daemon, it has to be started in order to work. The easiest way is to add =mpd= to your init system, e.g. with GNU Shepherd:

#+begin_src scheme
(define mpd
  (make <service>
    #:provides '(mpd)
    #:respawn? #t
    #:start (make-forkexec-constructor '("mpd" "--no-daemon"))
    #:stop (make-kill-destructor)))
#+end_src

You can also launch =mpd= manually, as it will daemonize itself by default. To check if MPD is working, run =mpc status=:
#+begin_src bash
mpc status
#+end_src

#+RESULTS:
: volume: n/a   repeat: off   random: off   single: off   consume: off

Take a look at [[https://mpd.readthedocs.io/en/stable/user.html#configuration][the official documentation]] for more information on this subject.

